IDEA Open Model
MatConcreteEc2 Class
Compatible with IDEA StatiCa 20.1
 Material concrete Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteEc2
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatConcreteEc2 : MatConcrete
Public Class MatConcreteEc2
	Inherits MatConcrete
The MatConcreteEc2 type exposes the following members.
Constructors
Name | Description
MatConcreteEc2
Initializes a new instance of the MatConcreteEc2 class
Top
Properties
Name | Description
AggregateType
 Type of aggregate
CalculateDependentValues
 Setting calculation dependent values on fck
CementClass
 Type of cement class
DiagramType
 Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
E
 Young's modulus
 (Inherited from Material.)
Ecm
 Secant modulus of elasticity of concrete - Ecm
Epsc1
 Compressive strain in the concrete - εc1
Epsc2
 Compressive strain in the concrete - εc2
Epsc3
 Compressive strain in the concrete - εc3
Epscu1
 Ultimate compressive strain in the concrete - εcu1
Epscu2
 Ultimate compressive strain in the concrete - εcu2
Epscu3
 Ultimate compressive strain in the concrete - εcu3
Fck
 Characteristic compressive cylinder strength of concrete at 28 days - fck
Fcm
 Mean value of concrete cylinder compressive strength - fcm
Fctk_0_05
 Characteristic axial tensile strength of concrete 5% quantile - fctk,0,05
Fctk_0_95
 Characteristic axial tensile strength of concrete 95% quantile - fctk,0,95
Fctm
 Mean value of axial tensile strength of concrete - fctm
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
LoadFromLibrary
 Load from library - try override properties from library find material by name
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
NFactor
 Coefficient n-factor - necessary parabolic part of stress-strain diagram - n
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
PlainConcreteDiagram
 Stress strain diagram with tension part
Poisson
 Poisson's ratio
 (Inherited from Material.)
SilicaFume
 Contains silica fume
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
StoneDiameter
 Diameter of stone
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
UnitMass
 Unit weight
 (Inherited from Material.)
UserDiagram
 Stress-strain diagram defined by user
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
Examples
 This sample shows how to create concrete material.
//Creating the model
OpenModel openModel = new OpenModel();
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
mat.Name = "Concrete1";
mat.UnitMass = 2500.0;
mat.E = 32.8e9;
mat.G = 13.667e9;
mat.Poisson = 0.2;
mat.SpecificHeat = 0.6;
mat.ThermalExpansion = 0.00001;
mat.ThermalConductivity = 45;
mat.Fck = 25.5e6;
mat.CalculateDependentValues = true;
//Set s-s diagram as a default parabolic
mat.DiagramType = ConcDiagramType.Parabolic;
//Set s-s diagram as an user defined
mat.DiagramType = ConcDiagramType.DefinedByUser;
var userDiagram = new Polygon2D();
mat.UserDiagram = userDiagram;
userDiagram.Points.Add(new Point2D() { X = -0.021, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.02, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.0025, Y = -80000000});
userDiagram.Points.Add(new Point2D() { X = -0.0024, Y = -79868660.43});
userDiagram.Points.Add(new Point2D() { X = -0.0023, Y = -79461961.9 });
userDiagram.Points.Add(new Point2D() { X = -0.0022, Y = -78762709.44});
userDiagram.Points.Add(new Point2D() { X = -0.0021, Y = -77756658.69});
userDiagram.Points.Add(new Point2D() { X = -0.0019, Y = -74785483.74    });
userDiagram.Points.Add(new Point2D() { X = -0.0017, Y = -70514061.33    });
userDiagram.Points.Add(new Point2D() { X = -0.0015, Y = -64981949.46    });
userDiagram.Points.Add(new Point2D() { X = -0.001    , Y = -46511627.91    });
userDiagram.Points.Add(new Point2D() { X = -0.0005, Y = -23904382.47    });
userDiagram.Points.Add(new Point2D() { X = 0, Y = 0});
userDiagram.Points.Add(new Point2D() { X = 0.001, Y = 0 });
//Setting thermal characteristcs of material (in this case by the code)
mat.StateOfThermalConductivity = ThermalConductivityState.Code;
mat.StateOfThermalExpansion = ThermalExpansionState.Code;
mat.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
mat.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(mat);
See Also
Reference
IdeaRS.OpenModel.Material Namespace